### 1. Список акторов
* Гость
* Авторизированный пользователь
* Авторизированный через ИСУ пользователь 
* Админ

### 2. Диаграмма прецедентов использования

### 3. Спецификации прецедентов использования

| Прецедент использования | Регистрация пользователя |
| :---: | :---: | 
| Действующие лица | Гость | 
| Краткое описание | Позволяет зарегистрировать в системе новую учетную запись | 
| Предусловия | Желание зарегистрировать новую учетную запись |
| Основной поток | Гость заполняет регистрационную форму, обязательно указав почту, пароль и логин (совпадаюие с ису, если студент итмо и хочет синхронизацию с расписанием), после чего отправляет на регистрацию | 
| Альтернативные потоки | Гость неверно заполнил регистрационную форму или учетная запись с таким именем уже существует. Гость получает сообщение об ошибке и должен либо повторно заполнить форму, либо отменить регистрацию |
| Постусловия | Если прецедент использования завершился успешно, в системе регистрируется новая учетная запись, в противном случае состояние системы остается неизменным | 

| Прецедент использования | Авторизация |
| :---: | :---: | 
| Действующие лица | Гость | 
| Краткое описание | Позволяет войти в существующую учетную запись | 
| Предусловия | Желание синхронизировать, восстановить или хранить задачи |
| Основной поток | Гость заполняет обязательные поля Логина и Пароля после чего отправляет данные на проверку | 
| Альтернативные потоки | Гость неверно заполнил поля Логина и/или Пароля, получает сообщение об ошибке и должен либо повторно заполнить форму, либо отменить авторизацию |
| Постусловия | Если прецедент использования завершился успешно, в системе регистрируется новая учетная запись, в противном случае состояние системы остается неизменным |

| Прецедент использования | Удаление аккаунта |
| :---: | :---: | 
| Действующие лица | Авторизированный пользователь, Авторизированный через ИСУ пользователь | 
| Краткое описание | Позволяет удалить существующую учетную запись | 
| Предусловия | Желание уничтожить свой аккаунт и все содержащиеся в нем данные |
| Основной поток | Пользователь отправляет запрос на удаление аккаунта, вводит пароль, подтверждает удаление аккаунта | 
| Альтернативные потоки | Пользователь неверно ввел пароль/не подтвердил удаление, должен либо повторно выполнить процедуру, либо дальше пользоваться приложением |
| Постусловия | Если прецедент использования завершился успешно, из системы удаляется пользователь, в противном случае состояние системы остается неизменным |
